{
  "backend/main.mo": "Motoko actor handling access-controlled user profiles and story creation with in-memory storage and upgrade hooks.",
  "feature_evidence.json": "Feature evidence report mapping a UI update to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind CSS base styles defining a warm green color system for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for Home, Login, and Stories using AppLayout.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapping all pages with a header, main content area, and footer.",
  "frontend/src/components/AuthStatus.tsx": "Displays the logged‑in user's profile name and provides a sign‑out button.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright text and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky navigation bar with links, branding, and authentication status.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal prompting new users to enter and save their display name.",
  "frontend/src/components/StoryList.tsx": "Renders stories with author names via profiles or principal fallback and relative timestamps.",
  "frontend/src/components/StorySubmissionForm.tsx": "Form allowing authenticated users to submit new stories with validation and loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the authenticated user's profile using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state and exposes identity, login, and logout functions via context.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for organizing feature-specific hooks.",
  "frontend/src/hooks/useStories.ts": "Provides hooks to fetch all stories and add new stories through the backend actor.",
  "frontend/src/hooks/useUserProfiles.ts": "Fetches multiple user profiles by principal, handling missing profiles gracefully.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for theming in light and dark modes.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/HomePage.tsx": "Landing page presenting app features with navigation to browse stories or sign in.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login and redirects users to profile setup or stories after authentication.",
  "frontend/src/pages/StoriesPage.tsx": "Shows story submission for authenticated users and lists all stories with loading and error states.",
  "frontend/src/utils/principalDisplay.ts": "Generates a short fallback display name from a Principal string.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL params (including hash routing), storing them in sessionStorage, and clearing or persisting them.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project’s current state, implemented features, pending feature requests, and metadata."
}