{
  "backend/main.mo": "Motoko canister handling user profiles and story creation with access control and in‑memory storage.",
  "feature_evidence.json": "Feature evidence report mapping UI text updates to affected frontend files and test IDs.",
  "frontend-file-summaries.txt": "Text file listing short summaries for all frontend components, pages, hooks, and config files.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables and light/dark mode color tokens.",
  "frontend/index.html": "HTML entry point setting up the root element and document title \"yor txt\".",
  "frontend/src/App.tsx": "Configures TanStack Router with routes for Home, Login, and Stories wrapped in AppLayout.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header, footer, and routed page content structure.",
  "frontend/src/components/AuthStatus.tsx": "Displays current user name and sign‑out button using Internet Identity and React Query.",
  "frontend/src/components/Footer.tsx": "Footer showing current year, \"yor txt\" copyright, and caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Responsive header with \"yor txt\" branding, navigation buttons, and auth status.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal prompting new users to enter and save their display name.",
  "frontend/src/components/StoryList.tsx": "Renders stories with author info, timestamps, and formatted content.",
  "frontend/src/components/StorySubmissionForm.tsx": "Form for submitting new stories with validation and loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the caller’s user profile using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, managing login, stored identities, and related state.",
  "frontend/src/hooks/useQueries.ts": "Empty module exporting nothing, placeholder for feature-specific hooks.",
  "frontend/src/hooks/useStories.ts": "Provides hooks to fetch all stories and submit new ones through the backend actor.",
  "frontend/src/hooks/useUserProfiles.ts": "Fetches multiple user profiles by principal, deduplicating and aggregating results.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and basic styling utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Landing page with marketing content and navigation to stories or login.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login and shows profile setup when required.",
  "frontend/src/pages/StoriesPage.tsx": "Displays story list, story submission for authenticated users, and prompts login when needed.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash-based), storing/retrieving them in sessionStorage, and persisting or clearing them.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, including implemented features, pending feature requests, and metadata for the 'yor txt' app."
}